## Machine Learning and Data Science Project

#### Students:  
m20190784 - **Benedita Pinto Nunes**    
m20191416 - **Diogo Rodrigues Silva**                      
m20191429 - **Miguel Sena e Silva**                

#### Database  
***Group33_LaGoste_Campaign.xlsx*** 

retrieved from  
http://elearning.novaims.unl.pt/moodle/pluginfile.php?file=%2F62270%2Fmod_folder%2Fcontent%2F0%2F201920_Group_Datasets.zip&forcedownload=1  

at 2020/04/01.

#### Imports for this project

In [1]:
import numpy as np
import pandas as pd

#### Obtaining and pre-processing data

In [2]:
# Obtaining and understanding data
g33 = pd.read_excel('Group33_LaGoste_Campaign.xlsx', index_col=0)
g33.head()

,Year_Birth,Education,Marital_Status,Income,Kidhome,Teenhome,Dt_Customer,Recency,MntSneakers,MntTShirts,...,NumCatalogPurchases,NumStorePurchases,NumWebVisitsMonth,AcceptedCmp2,AcceptedCmp3,AcceptedCmp4,AcceptedCmp5,AcceptedCmp1,Complain,DepVar
Custid,,,,,,,,,,,,,,,,,,,,,
50004110,1975,PhD,Together,90888.0,0,0,2017-04-17,6,85,3,...,0,1,0,0,0,0,0,0,0,0
50004118,1968,Master,Married,84214.0,0,1,2016-07-21,10,532,132,...,5,14,5,0,0,0,0,0,0,0
50004130,1980,Graduation,Married,62537.0,1,1,2015-12-07,73,244,36,...,4,7,7,0,0,0,0,0,0,0
50004142,1976,Basic,Divorced,21462.0,1,0,2015-12-18,53,3,15,...,2,4,7,0,0,0,0,0,0,0
50004146,1985,Master,Together,87743.0,0,0,2017-03-07,93,286,185,...,5,6,1,0,0,0,0,0,0,0

In [3]:
# Column cleanup - all lower letters
print('Prior colunm names: \n',g33.columns)
print()
g33.columns = [col.lower() for col in g33]
print('Current colunm names: \n',g33.columns)

Prior colunm names:
 Index(['Year_Birth', 'Education', 'Marital_Status', 'Income', 'Kidhome',
       'Teenhome', 'Dt_Customer', 'Recency', 'MntSneakers', 'MntTShirts',
       'MntRackets', 'MntWatches', 'MntHats', 'MntPremium_Brand',
       'NumDealsPurchases', 'NumWebPurchases', 'NumCatalogPurchases',
       'NumStorePurchases', 'NumWebVisitsMonth', 'AcceptedCmp2',
       'AcceptedCmp3', 'AcceptedCmp4', 'AcceptedCmp5', 'AcceptedCmp1',
       'Complain', 'DepVar'],
      dtype='object')

Current colunm names:
 Index(['year_birth', 'education', 'marital_status', 'income', 'kidhome',
       'teenhome', 'dt_customer', 'recency', 'mntsneakers', 'mnttshirts',
       'mntrackets', 'mntwatches', 'mnthats', 'mntpremium_brand',
       'numdealspurchases', 'numwebpurchases', 'numcatalogpurchases',
       'numstorepurchases', 'numwebvisitsmonth', 'acceptedcmp2',
       'acceptedcmp3', 'acceptedcmp4', 'acceptedcmp5', 'acceptedcmp1',
       'complain', 'depvar'],
      dtype='object')

In [4]:
print('Info for g33:\n')
g33.info()

Info for g33:

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2500 entries, 50004110 to 50044102
Data columns (total 26 columns):
year_birth             2500 non-null int64
education              2500 non-null object
marital_status         2500 non-null object
income                 2475 non-null float64
kidhome                2500 non-null int64
teenhome               2500 non-null int64
dt_customer            2500 non-null datetime64[ns]
recency                2500 non-null int64
mntsneakers            2500 non-null int64
mnttshirts             2500 non-null int64
mntrackets             2500 non-null int64
mntwatches             2500 non-null int64
mnthats                2453 non-null float64
mntpremium_brand       2458 non-null float64
numdealspurchases      2500 non-null int64
numwebpurchases        2500 non-null int64
numcatalogpurchases    2500 non-null int64
numstorepurchases      2500 non-null int64
numwebvisitsmonth      2500 non-null int64
acceptedcmp2           2500 non-null int64
acceptedcmp3           2500 non-null int64
acceptedcmp4           2500 non-null int64
acceptedcmp5           2500 non-null int64
acceptedcmp1           2500 non-null int64
complain               2500 non-null int64
depvar                 2500 non-null int64
dtypes: datetime64[ns](1), float64(3), int64(20), object(2)
memory usage: 527.3+ KB

In [7]:
# look for duplicate data
print('Prior shape:\n',g33.shape)
print()
g33.drop_duplicates(inplace= True)
print('Current shape:\n',g33.shape) 

print('\nno duplicates found...')

Prior shape:
 (2500, 26)

Current shape:
 (2500, 26)

no duplicates found...

In [8]:
# look for missing values
print('Columns with missing values:\n',g33.columns[g33.isnull().any()])
g33.isnull().sum()

Columns with missing values:
 Index(['income', 'mnthats', 'mntpremium_brand'], dtype='object')

year_birth              0
education               0
marital_status          0
income                 25
kidhome                 0
teenhome                0
dt_customer             0
recency                 0
mntsneakers             0
mnttshirts              0
mntrackets              0
mntwatches              0
mnthats                47
mntpremium_brand       42
numdealspurchases       0
numwebpurchases         0
numcatalogpurchases     0
numstorepurchases       0
numwebvisitsmonth       0
acceptedcmp2            0
acceptedcmp3            0
acceptedcmp4            0
acceptedcmp5            0
acceptedcmp1            0
complain                0
depvar                  0
dtype: int64

In [9]:
# parsing income by education category
pv_inc2edu = g33[['income', 'education']].groupby(['education'])
pv_inc2edu.describe()

            income                                                         \
             count          mean           std     min       25%      50%
education
2n Cycle     437.0  62090.132723  25053.341093  4063.0  41788.00  63414.0
Basic        316.0  50429.746835  30455.854111  4933.0  26131.50  42973.0
Graduation  1229.0  64649.281530  26040.481159  1231.0  44596.00  63816.0
Master       325.0  67176.141538  24973.640873  6244.0  47562.00  66406.0
PhD          168.0  69505.339286  25771.604658  5643.0  48480.75  68710.0


                 75%       max
education
2n Cycle    81531.00  123230.0
Basic       73912.00  171472.0
Graduation  84618.00  163153.0
Master      86363.00  150997.0
PhD         89612.25  139909.0

In [10]:
# Defining median income by education category
_income = pv_inc2edu.apply(np.nanmedian)
_income

education
2n Cycle      63414.0
Basic         42973.0
Graduation    63816.0
Master        66406.0
PhD           68710.0
dtype: float64

In [ ]:
g33[g33['income'].isnull()].info()

In [12]:
# replacing income NaNs with median income by education category
nan_income = g33[g33['income'].isnull()].merge(_income.rename('edu_median'),
                                               left_on = 'education',
                                               right_index = True)
nan_income['income'] = nan_income['edu_median']
nan_income.drop('edu_median', axis=1, inplace= True)  # drops 'edu_median' column
g33 = pd.concat([g33[g33['income'].notnull()],nan_income])

In [ ]:
g33.describe(include = 'all')